Revit 2024 API
View.CanApplyColorFillScheme Method
 Checks if the id can be applied as the scheme id of specified category to this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool CanApplyColorFillScheme(
	ElementId categoryId,
	ElementId schemeId
)
Visual Basic
Public Function CanApplyColorFillScheme ( _
	categoryId As ElementId, _
	schemeId As ElementId _
) As Boolean
Visual C++
public:
bool CanApplyColorFillScheme(
	ElementId^ categoryId,
	ElementId^ schemeId
)
Parameters
categoryId
Type: Autodesk.Revit.DB.ElementId
 The id of category.
schemeId
Type: Autodesk.Revit.DB.ElementId
 The id of color fill scheme.
Return Value
 True if the id can be applied as the scheme id of specified category in this view, false otherwise.
Remarks
The input scheme id could be InvalidElementId to clear the scheme for the specified category.
Some examples of returnning false:
The id is not a color fill scheme id.
The specified category is not supported by this view.
The category of scheme is not the same as the specified category.
The view is area plan but the scheme category is not OST_Areas, or their [!:Autodesk::Revit::DB::AreaScheme] are not the same.
Etc.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace